<template>
  <section id="button">
    <img class="img" src="~/assets/button.svg" alt="Кнопка" />
    <h2>О кнопке</h2>
    <i>Кажется, что если на кнопке написано, что её нужно нажать, то тут и думать не о чем. Вот из-за такого люди и взрываются.</i>

    <p>Определение индикатора — см. Приложение А.</p>
    <p>Определение элемента питания — см. Приложение Б.</p>

    <p>Следуйте следующим правилам в том порядке, в котором они указаны. Выполните первое подходящее действие:</p>

    <ol>
      <li>Если кнопка синяя, а на кнопке написано «Прервать», задержите кнопку и смотрите пункт «Удержание кнопки».</li>
      <li>Если на бомбе больше 1 элемента питания, а на кнопке написано «Взорвать», нажмите и резко отпустите кнопку.</li>
      <li>Если кнопка белая, а на корпусе бомбы есть горящий индикатор «CAR», задержите кнопку и смотрите пункт «Удержание кнопки».</li>
      <li>Если на бомбе больше 2 элементов питания, а на корпусе бомбы есть горящий индикатор «FRK», нажмите и резко отпустите кнопку.</li>
      <li>Если кнопка желтая, задержите кнопку и смотрите пункт «Удержание кнопки».</li>
      <li>Если кнопка красная, а на кнопке написано «Держать», нажмите и резко отпустите кнопку.</li>
      <li>Если не подходит ни одно из вышеперечисленных правил, задержите кнопку и смотрите пункт «Удержание кнопки».</li>
    </ol>

    <b>Удержание кнопки</b>
    <p>Если вы начнете удерживать кнопку, на правой стороне модуля зажжется цветная полоска. В зависимости от её цвета вам нужно отпустить кнопку в определенный момент времени:</p>
    <ul>
      <li><u>Синяя полоска:</u> отпустите, когда любая цифра обратного таймера будет равна 4.</li>
      <li><u>Белая полоска:</u> отпустите, когда любая цифра обратного таймера будет равна 1.</li>
      <li><u>Желтая полоска:</u> отпустите, когда любая цифра обратного таймера будет равна 5.</li>
      <li><u>Полоска любого другого цвета:</u> отпустите, когда любая цифра обратного таймера будет равна 1.</li>
    </ul>
  </section>
</template>

<script setup lang="ts">

</script>

<style scoped>
.img {
  width: 110px;
  float: right;
  margin: 0 12px;
}
</style>