<template>
  <section id="wires">
    <img class="img" src="~/assets/wires.svg" alt="Провода" />
    <h2>О проводах</h2>
    <i>Провода — кровь электроники! Стоп, нет, электричество — кровь. Провода, скорее, артерии. Вены? Неважно…</i>

    <ul>
      <li>Модуль содержит от 3 до 6 проводов.</li>
      <li>Только один правильный провод необходимо перерезать для обезвреживания модуля.</li>
      <li>Нумерация проводов отсчитывается, начиная от верхнего.</li>
    </ul>

    <table>
      <tr>
        <td>
          <b>3 провода:</b>
          <p>Если нет красных проводов, режьте второй.</p>
          <p>Иначе, если последний провод белый, режьте последний.</p>
          <p>Иначе, если синих проводов больше, чем один, режьте последний синий.</p>
          <p>Иначе режьте последний.</p>
        </td>
      </tr>
      <tr>
        <td>
          <b>4 провода:</b>
          <p>Если красных проводов больше, чем один, и последняя цифра серийного номера нечетная, режьте последний красный.</p>
          <p>Иначе, если последний провод желтый, а красных нет, режьте первый.</p>
          <p>Иначе, если синий провод всего и только один, режьте первый.</p>
          <p>Иначе, если желтых проводов больше, чем один, режьте последний.</p>
          <p>Иначе режьте второй.</p>
        </td>
      </tr>
      <tr>
        <td>
          <b>5 проводов:</b>
          <p>Если последний провод черный, и последняя цифра серийного номера нечетная, режьте четвертый.</p>
          <p>Иначе, если красный провод всего и только один, а желтых больше, чем один, режьте первый.</p>
          <p>Иначе, если черных проводов нет, режьте второй.</p>
          <p>Иначе режьте первый.</p>
        </td>
      </tr>
      <tr>
        <td>
          <b>6 проводов:</b>
          <p>Если желтых проводов нет, и последняя цифра серийного номера нечетная, режьте третий.</p>
          <p>Иначе, если желтый провод всего и только один, а белых проводов больше, чем один, режьте четвертый.</p>
          <p>Иначе, если красных проводов нет, режьте последний.</p>
          <p>Иначе режьте четвертый.</p>
        </td>
      </tr>
    </table>
  </section>
</template>

<script setup lang="ts">

</script>

<style scoped>
.img {
  width: 110px;
  float: right;
  margin: 0 12px;
}
</style>